sklad_uchet/src/Reports/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОстаткиНоменклатуры</name>
</mdclass:Report>

sklad_uchet/src/AccumulationRegisters/СкладскойУчет/СкладскойУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СкладскойУчет</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

sklad_uchet/src/Documents/Списание/Списание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Списание</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.СкладскойУчет</registerRecords>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

sklad_uchet/src/Reports/ОстаткиНоменклатуры/ManagerModule.bsl
Функция ОбнаруженыМинуса(Документ)Экспорт
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеСостав.Номенклатура КАК Номенклатура,
		|	СУММА(СписаниеСостав.Количество) КАК КоличествоКСписанию,
		|	СписаниеСостав.Ссылка.Склад КАК Склад
		|ПОМЕСТИТЬ ДанныеПоНоменклатуре
		|ИЗ
		|	Документ.Списание.Состав КАК СписаниеСостав
		|ГДЕ
		|	СписаниеСостав.Ссылка = &Документ
		|
		|СГРУППИРОВАТЬ ПО
		|	СписаниеСостав.Номенклатура,
		|	СписаниеСостав.Ссылка.Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеПоНоменклатуре.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(СкладскойУчетОстатки.КоличествоОстаток, 0) - ДанныеПоНоменклатуре.КоличествоКСписанию КАК ПрогнозныйОстаток
		|ИЗ
		|	ДанныеПоНоменклатуре КАК ДанныеПоНоменклатуре
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СкладскойУчет.Остатки(&Период, ) КАК СкладскойУчетОстатки
		|		ПО ДанныеПоНоменклатуре.Номенклатура = СкладскойУчетОстатки.Номенклатура
		|			И ДанныеПоНоменклатуре.Склад = СкладскойУчетОстатки.Склад
		|ГДЕ
		|	ЕСТЬNULL(СкладскойУчетОстатки.КоличествоОстаток, 0) - ДанныеПоНоменклатуре.КоличествоКСписанию < 0";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Период", Новый Граница (Документ.МоментВремени(),ВидГраницы.Исключая));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой()  Тогда
	    Возврат Ложь;	
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	  Сообщить(СтрШаблон("Не хватает номенклатуры: %1 в количестве %2", ВыборкаДетальныеЗаписи.Номенклатура,
	  																	-ВыборкаДетальныеЗаписи.ПрогнозныйОстаток));	
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

     Возврат Истина;

	

КонецФункции // ОбнаруженыМинуса()
